rjt-rockx/esphome-host-linux/components/esp32_ble_client/ble_gatt_host.cpp
#ifdef USE_HOST

#include "ble_gatt_host.h"

#include "esphome/components/esp32_ble_tracker/esp32_ble_tracker.h"
#include "esphome/core/log.h"

#include <cerrno>
#include <cstring>

#include <sys/eventfd.h>
#include <unistd.h>

#include <systemd/sd-event.h>

namespace esphome {
namespace esp32_ble_client {

namespace espbt = esphome::esp32_ble_tracker;

static const char *const TAG = "ble_gatt_host";

// ---------------------------------------------------------------------------
// BLEGattHostThread — shared worker (one thread, one sd_event loop)
// ---------------------------------------------------------------------------

BLEGattHostThread &BLEGattHostThread::instance() {
  static BLEGattHostThread inst;
  return inst;
}

// eventfd wake handler: just drains the counter; the real work (servicing each
// host's command queue) happens after sd_event_run returns in run_().
static int wake_handler(sd_event_source * /*s*/, int fd, uint32_t /*revents*/, void * /*userdata*/) {
  uint64_t v;
  ssize_t r = read(fd, &v, sizeof(v));
  (void) r;  // best-effort drain
  return 0;
}

void BLEGattHostThread::ensure_started_() {
  bool expected = false;
  if (!this->running_.compare_exchange_strong(expected, true))
    return;  // already started

  this->wake_fd_ = eventfd(0, EFD_CLOEXEC | EFD_NONBLOCK);
  if (this->wake_fd_ < 0) {
    ESP_LOGE(TAG, "eventfd() failed: %s", std::strerror(errno));
    this->running_ = false;
    return;
  }
  this->thread_ = std::thread([this] { this->run_(); });
  // Process-lifetime daemon worker: detach so the joinable std::thread doesn't
  // std::terminate at exit (the singleton outlives all hosts). The loop checks
  // stop_ for clean shutdown when that is wired.
  this->thread_.detach();
}

void BLEGattHostThread::run_() {
  if (sd_event_new(&this->event_) < 0) {
    ESP_LOGE(TAG, "sd_event_new failed");
    return;
  }
  sd_event_add_io(this->event_, &this->wake_source_, this->wake_fd_, EPOLLIN, wake_handler, this);

  while (!this->stop_.load()) {
    // Service the loop; 1s timeout bounds shutdown latency. Each return is an
    // opportunity to run any newly-queued per-host commands.
    int r = sd_event_run(this->event_, 1000000 /* us */);
    if (r < 0) {
      ESP_LOGW(TAG, "sd_event_run: %s", std::strerror(-r));
      break;
    }
    std::vector<BLEGattHost *> snapshot;
    {
      std::lock_guard<std::mutex> g(this->hosts_mu_);
      snapshot = this->hosts_;
    }
    for (auto *h : snapshot)
      h->worker_process_commands();
  }

  if (this->wake_source_ != nullptr)
    sd_event_source_unref(this->wake_source_);
  if (this->event_ != nullptr)
    this->event_ = sd_event_unref(this->event_);
  if (this->wake_fd_ >= 0)
    ::close(this->wake_fd_);
}

void BLEGattHostThread::attach(BLEGattHost *host) {
  this->ensure_started_();
  {
    std::lock_guard<std::mutex> g(this->hosts_mu_);
    this->hosts_.push_back(host);
  }
  this->wake();
}

void BLEGattHostThread::detach(BLEGattHost *host) {
  std::lock_guard<std::mutex> g(this->hosts_mu_);
  for (auto it = this->hosts_.begin(); it != this->hosts_.end(); ++it) {
    if (*it == host) {
      this->hosts_.erase(it);
      break;
    }
  }
}

void BLEGattHostThread::wake() {
  if (this->wake_fd_ < 0)
    return;
  uint64_t v = 1;
  ssize_t r = write(this->wake_fd_, &v, sizeof(v));
  (void) r;
}

BLEGattHost *BLEGattHostThread::find_host_by_device_(const char *device_path) {
  if (device_path == nullptr)
    return nullptr;
  std::lock_guard<std::mutex> g(this->hosts_mu_);
  for (auto *h : this->hosts_)
    if (h->device_path() == device_path)
      return h;
  return nullptr;
}

// org.bluez.Agent1 vtable. CRITICAL: registered NON-DEFAULT (RegisterAgent
// only). We never call RequestDefaultAgent, so the user's system/desktop agent
// keeps handling all other pairings (invariant: don't hijack the system agent).
static const sd_bus_vtable AGENT_VTABLE[] = {
    SD_BUS_VTABLE_START(0),
    SD_BUS_METHOD("Release", "", "", BLEGattHostThread::agent_release_, SD_BUS_VTABLE_UNPRIVILEGED),
    SD_BUS_METHOD("RequestPasskey", "o", "u", BLEGattHostThread::agent_request_passkey_, SD_BUS_VTABLE_UNPRIVILEGED),
    SD_BUS_METHOD("DisplayPasskey", "ouq", "", BLEGattHostThread::agent_display_passkey_, SD_BUS_VTABLE_UNPRIVILEGED),
    SD_BUS_METHOD("RequestConfirmation", "ou", "", BLEGattHostThread::agent_request_confirmation_,
                  SD_BUS_VTABLE_UNPRIVILEGED),
    SD_BUS_METHOD("Cancel", "", "", BLEGattHostThread::agent_cancel_, SD_BUS_VTABLE_UNPRIVILEGED),
    SD_BUS_VTABLE_END};

void BLEGattHostThread::ensure_agent(sd_bus *bus) {
  if (this->agent_registered_ || bus == nullptr)
    return;
  // Export the Agent1 object.
  int r = sd_bus_add_object_vtable(bus, &this->agent_vtable_slot_, AGENT_PATH, "org.bluez.Agent1", AGENT_VTABLE, this);
  if (r < 0) {
    ESP_LOGW(TAG, "agent vtable export failed: %s", std::strerror(-r));
    return;
  }
  // RegisterAgent (NOT RequestDefaultAgent — never hijack the system agent).
  sd_bus_error err = SD_BUS_ERROR_NULL;
  r = sd_bus_call_method(bus, "org.bluez", "/org/bluez", "org.bluez.AgentManager1", "RegisterAgent", &err, nullptr,
                         "os", AGENT_PATH, "KeyboardDisplay");
  if (r < 0) {
    ESP_LOGW(TAG, "RegisterAgent failed: %s", err.message ? err.message : std::strerror(-r));
    sd_bus_error_free(&err);
    return;
  }
  sd_bus_error_free(&err);
  this->agent_registered_ = true;
  ESP_LOGI(TAG, "registered non-default pairing agent (system agent untouched)");
}

int BLEGattHostThread::agent_release_(sd_bus_message *m, void * /*ud*/, sd_bus_error * /*e*/) {
  return sd_bus_reply_method_return(m, "");
}
int BLEGattHostThread::agent_cancel_(sd_bus_message *m, void * /*ud*/, sd_bus_error * /*e*/) {
  return sd_bus_reply_method_return(m, "");
}
int BLEGattHostThread::agent_request_passkey_(sd_bus_message *m, void *ud, sd_bus_error * /*e*/) {
  auto *self = static_cast<BLEGattHostThread *>(ud);
  const char *dev = nullptr;
  sd_bus_message_read(m, "o", &dev);
  auto *host = self->find_host_by_device_(dev);
  if (host == nullptr)
    return sd_bus_reply_method_errorf(m, "org.bluez.Error.Rejected", "no host for %s", dev ? dev : "?");
  host->agent_request_passkey(m);  // parks the reply; answered via passkey_reply
  return 1;                        // tell sd-bus the reply is deferred
}
int BLEGattHostThread::agent_display_passkey_(sd_bus_message *m, void *ud, sd_bus_error * /*e*/) {
  auto *self = static_cast<BLEGattHostThread *>(ud);
  const char *dev = nullptr;
  uint32_t passkey = 0;
  uint16_t entered = 0;
  sd_bus_message_read(m, "ouq", &dev, &passkey, &entered);
  auto *host = self->find_host_by_device_(dev);
  if (host != nullptr)
    host->agent_display_passkey(passkey);
  return sd_bus_reply_method_return(m, "");
}
int BLEGattHostThread::agent_request_confirmation_(sd_bus_message *m, void *ud, sd_bus_error * /*e*/) {
  auto *self = static_cast<BLEGattHostThread *>(ud);
  const char *dev = nullptr;
  uint32_t passkey = 0;
  sd_bus_message_read(m, "ou", &dev, &passkey);
  auto *host = self->find_host_by_device_(dev);
  if (host == nullptr)
    return sd_bus_reply_method_errorf(m, "org.bluez.Error.Rejected", "no host for %s", dev ? dev : "?");
  host->agent_request_confirmation(m, passkey);  // parks the reply; answered via confirm_reply
  return 1;                                       // deferred reply
}

// ---------------------------------------------------------------------------
// BLEGattHost
// ---------------------------------------------------------------------------

BLEGattHost::BLEGattHost(std::string adapter, std::string device_path)
    : adapter_(std::move(adapter)), device_path_(std::move(device_path)) {}

BLEGattHost::~BLEGattHost() {
  BLEGattHostThread::instance().detach(this);
  this->close_bus_();
}

void BLEGattHost::enqueue_command_(HostGattCommand cmd) {
  {
    std::lock_guard<std::mutex> g(this->cmd_mu_);
    this->commands_.push_back(std::move(cmd));
  }
  BLEGattHostThread::instance().wake();
}

void BLEGattHost::connect() {
  BLEGattHostThread::instance().attach(this);  // idempotent registration
  this->enqueue_command_({HostGattCommand::Kind::CONNECT});
}

