rjt-rockx/esphome-host-linux/components/esp32_ble_client/ble_gatt_host.cpp
void BLEGattHost::disconnect() { this->enqueue_command_({HostGattCommand::Kind::DISCONNECT}); }

void BLEGattHost::read_char(uint16_t handle) {
  HostGattCommand c{HostGattCommand::Kind::READ_CHAR};
  c.handle = handle;
  this->enqueue_command_(std::move(c));
}
void BLEGattHost::read_desc(uint16_t handle) {
  HostGattCommand c{HostGattCommand::Kind::READ_DESC};
  c.handle = handle;
  this->enqueue_command_(std::move(c));
}
void BLEGattHost::write_char(uint16_t handle, const uint8_t *data, size_t len, bool response) {
  HostGattCommand c{HostGattCommand::Kind::WRITE_CHAR};
  c.handle = handle;
  c.flag = response;
  c.data.assign(data, data + len);
  this->enqueue_command_(std::move(c));
}
void BLEGattHost::write_desc(uint16_t handle, const uint8_t *data, size_t len, bool response) {
  HostGattCommand c{HostGattCommand::Kind::WRITE_DESC};
  c.handle = handle;
  c.flag = response;
  c.data.assign(data, data + len);
  this->enqueue_command_(std::move(c));
}
void BLEGattHost::set_notify(uint16_t handle, bool enable) {
  HostGattCommand c{HostGattCommand::Kind::SET_NOTIFY};
  c.handle = handle;
  c.flag = enable;
  this->enqueue_command_(std::move(c));
}
void BLEGattHost::read_rssi() { this->enqueue_command_({HostGattCommand::Kind::READ_RSSI}); }
void BLEGattHost::pair() { this->enqueue_command_({HostGattCommand::Kind::PAIR}); }
void BLEGattHost::passkey_reply(uint32_t passkey) {
  HostGattCommand c{HostGattCommand::Kind::PASSKEY_REPLY};
  c.passkey = passkey;
  this->enqueue_command_(std::move(c));
}
void BLEGattHost::confirm_reply(bool accept) {
  HostGattCommand c{HostGattCommand::Kind::CONFIRM_REPLY};
  c.flag = accept;
  this->enqueue_command_(std::move(c));
}
void BLEGattHost::remove_bond() { this->enqueue_command_({HostGattCommand::Kind::REMOVE_BOND}); }

std::deque<HostGattEvent> BLEGattHost::drain_events() {
  std::deque<HostGattEvent> out;
  std::lock_guard<std::mutex> g(this->evt_mu_);
  out.swap(this->events_);
  return out;
}

void BLEGattHost::post_event_(HostGattEvent &&ev) {
  std::lock_guard<std::mutex> g(this->evt_mu_);
  this->events_.push_back(std::move(ev));
}

// --- worker thread ---

void BLEGattHost::worker_process_commands() {
  std::deque<HostGattCommand> cmds;
  {
    std::lock_guard<std::mutex> g(this->cmd_mu_);
    cmds.swap(this->commands_);
  }
  for (auto &c : cmds) {
    switch (c.kind) {
      case HostGattCommand::Kind::CONNECT:
        this->do_connect_();
        break;
      case HostGattCommand::Kind::DISCONNECT:
        this->do_disconnect_();
        break;
      case HostGattCommand::Kind::READ_CHAR:
        this->do_read_(c.handle, false);
        break;
      case HostGattCommand::Kind::READ_DESC:
        this->do_read_(c.handle, true);
        break;
      case HostGattCommand::Kind::WRITE_CHAR:
        this->do_write_(c.handle, c.data, c.flag, false);
        break;
      case HostGattCommand::Kind::WRITE_DESC:
        this->do_write_(c.handle, c.data, c.flag, true);
        break;
      case HostGattCommand::Kind::SET_NOTIFY:
        this->do_set_notify_(c.handle, c.flag);
        break;
      case HostGattCommand::Kind::READ_RSSI:
        this->do_read_rssi_();
        break;
      case HostGattCommand::Kind::PAIR:
        this->do_pair_();
        break;
      case HostGattCommand::Kind::PASSKEY_REPLY:
        this->do_passkey_reply_(c.passkey);
        break;
      case HostGattCommand::Kind::CONFIRM_REPLY:
        this->do_confirm_reply_(c.flag);
        break;
      case HostGattCommand::Kind::REMOVE_BOND:
        this->do_remove_bond_();
        break;
    }
  }
}

bool BLEGattHost::open_bus_() {
  if (this->bus_open_.load())
    return true;
  int r = sd_bus_open_system(&this->bus_);
  if (r < 0) {
    ESP_LOGW(TAG, "open system bus failed: %s", std::strerror(-r));
    return false;
  }
  // Unix-fd negotiation is needed later for AcquireWrite/Notify MTU probing.
  sd_bus_negotiate_fds(this->bus_, 1);

  // Attach this bus to the shared event loop so its replies/signals are serviced.
  sd_event *ev = BLEGattHostThread::instance().event();
  if (ev != nullptr)
    sd_bus_attach_event(this->bus_, ev, 0);

  // Subscribe to PropertiesChanged on this device path (for Connected changes).
  std::string match = "type='signal',interface='org.freedesktop.DBus.Properties',"
                      "member='PropertiesChanged',path='" +
                      this->device_path_ + "'";
  r = sd_bus_add_match(this->bus_, &this->props_slot_, match.c_str(), &BLEGattHost::on_properties_changed_, this);
  if (r < 0) {
    ESP_LOGW(TAG, "add_match failed: %s", std::strerror(-r));
  }
  this->bus_open_ = true;
  return true;
}

void BLEGattHost::close_bus_() {
  if (this->props_slot_ != nullptr) {
    sd_bus_slot_unref(this->props_slot_);
    this->props_slot_ = nullptr;
  }
  if (this->bus_ != nullptr) {
    sd_bus_flush_close_unref(this->bus_);
    this->bus_ = nullptr;
  }
  this->bus_open_ = false;
}

void BLEGattHost::do_connect_() {
  if (!this->open_bus_())
    return;
  // Check current Connected state first (don't trust cache); if already up,
  // synthesize a CONNECTED event.
  sd_bus_error err = SD_BUS_ERROR_NULL;
  int connected = 0;
  int r = sd_bus_get_property_trivial(this->bus_, "org.bluez", this->device_path_.c_str(), "org.bluez.Device1",
                                      "Connected", &err, 'b', &connected);
  sd_bus_error_free(&err);
  if (r >= 0 && connected) {
    this->worker_on_connected_changed(true);
    return;
  }

  // Device1.Connect() blocks until the link is up (or fails). On success the
  // Connected=true PropertiesChanged has already fired (→ CONNECTED). We retry
  // once on the well-known transient "le-connection-abort-by-local"; only a
  // genuine, non-recoverable failure posts DISCONNECTED — and only if the
  // signal handler hasn't already reported the device connected.
  for (int attempt = 0; attempt < 2; attempt++) {
    sd_bus_error cerr = SD_BUS_ERROR_NULL;
    r = sd_bus_call_method(this->bus_, "org.bluez", this->device_path_.c_str(), "org.bluez.Device1", "Connect", &cerr,
                           nullptr, "");
    if (r >= 0) {
      sd_bus_error_free(&cerr);
      return;  // connected; CONNECTED already posted by the Connected signal
    }
    const char *name = cerr.name ? cerr.name : "";
    const char *msg = cerr.message ? cerr.message : "";
    bool abort_local = (std::strstr(msg, "le-connection-abort-by-local") != nullptr);
    bool not_found = (std::strstr(name, "UnknownObject") != nullptr) || (std::strstr(name, "DoesNotExist") != nullptr);
    bool already_connected = (std::strstr(name, "AlreadyConnected") != nullptr);
    ESP_LOGW(TAG, "Connect(%s) attempt %d: %s", this->device_path_.c_str(), attempt, msg[0] ? msg : std::strerror(-r));
    sd_bus_error_free(&cerr);

