rjt-rockx/esphome-host-linux/components/esp32_ble_client/ble_gatt_host.cpp
    if (already_connected) {
      this->worker_on_connected_changed(true);
      return;
    }
    if (abort_local && attempt == 0) {
      continue;  // transient: retry once
    }
    // Genuine failure. Only post DISCONNECTED if BlueZ doesn't already consider
    // the device connected (avoid racing the Connected signal).
    sd_bus_error perr = SD_BUS_ERROR_NULL;
    int connected2 = 0;
    sd_bus_get_property_trivial(this->bus_, "org.bluez", this->device_path_.c_str(), "org.bluez.Device1", "Connected",
                                &perr, 'b', &connected2);
    sd_bus_error_free(&perr);
    if (connected2) {
      this->worker_on_connected_changed(true);
    } else {
      HostGattEvent ev;
      ev.kind = HostGattEvent::Kind::DISCONNECTED;
      ev.disc_reason = not_found ? 0x0a /*NOT_FOUND*/ : 0x85 /*ERROR*/;
      this->post_event_(std::move(ev));
    }
    return;
  }
}

void BLEGattHost::do_disconnect_() {
  if (!this->bus_open_.load()) {
    // Already torn down — report disconnected so the client reaches IDLE.
    HostGattEvent ev;
    ev.kind = HostGattEvent::Kind::DISCONNECTED;
    this->post_event_(std::move(ev));
    return;
  }
  sd_bus_error err = SD_BUS_ERROR_NULL;
  // Fire-and-forget; ignore UNKNOWN_OBJECT (already gone). The Connected=false
  // signal posts DISCONNECTED.
  sd_bus_call_method(this->bus_, "org.bluez", this->device_path_.c_str(), "org.bluez.Device1", "Disconnect", &err,
                     nullptr, "");
  sd_bus_error_free(&err);
}

namespace {

// Map a BlueZ GattCharacteristic1 "Flags" string to an esp_gatt_char_prop_t bit.
uint8_t flag_to_prop(const char *flag) {
  if (std::strcmp(flag, "broadcast") == 0)
    return ESP_GATT_CHAR_PROP_BIT_BROADCAST;
  if (std::strcmp(flag, "read") == 0)
    return ESP_GATT_CHAR_PROP_BIT_READ;
  if (std::strcmp(flag, "write-without-response") == 0)
    return ESP_GATT_CHAR_PROP_BIT_WRITE_NR;
  if (std::strcmp(flag, "write") == 0)
    return ESP_GATT_CHAR_PROP_BIT_WRITE;
  if (std::strcmp(flag, "notify") == 0)
    return ESP_GATT_CHAR_PROP_BIT_NOTIFY;
  if (std::strcmp(flag, "indicate") == 0)
    return ESP_GATT_CHAR_PROP_BIT_INDICATE;
  if (std::strcmp(flag, "authenticated-signed-writes") == 0)
    return ESP_GATT_CHAR_PROP_BIT_AUTH;
  if (std::strcmp(flag, "extended-properties") == 0)
    return ESP_GATT_CHAR_PROP_BIT_EXT_PROP;
  return 0;
}

// A flat parsed GATT object from GetManagedObjects.
struct GattObj {
  std::string path;
  enum { SERVICE, CHAR, DESC, OTHER } kind{OTHER};
  espbt::ESPBTUUID uuid;
  uint16_t handle{0};
  bool has_handle{false};
  std::string parent;  // Service (for char) / Characteristic (for descr)
  uint8_t props{0};    // chars only
};

// Read one a{sv} property dict for a single interface, filling a GattObj.
void parse_gatt_iface_props(sd_bus_message *m, const char *iface, GattObj &obj) {
  bool is_char = std::strcmp(iface, "org.bluez.GattCharacteristic1") == 0;
  bool is_desc = std::strcmp(iface, "org.bluez.GattDescriptor1") == 0;
  bool is_svc = std::strcmp(iface, "org.bluez.GattService1") == 0;
  if (is_char)
    obj.kind = GattObj::CHAR;
  else if (is_desc)
    obj.kind = GattObj::DESC;
  else if (is_svc)
    obj.kind = GattObj::SERVICE;

  sd_bus_message_enter_container(m, 'a', "{sv}");
  for (;;) {
    if (sd_bus_message_enter_container(m, 'e', "sv") <= 0)
      break;
    const char *key = nullptr;
    sd_bus_message_read(m, "s", &key);
    if (key != nullptr && std::strcmp(key, "UUID") == 0) {
      const char *uuid = nullptr;
      sd_bus_message_read(m, "v", "s", &uuid);
      if (uuid != nullptr)
        obj.uuid = espbt::ESPBTUUID::from_uuid_str(uuid);
    } else if (key != nullptr && std::strcmp(key, "Handle") == 0) {
      uint16_t h = 0;
      if (sd_bus_message_read(m, "v", "q", &h) >= 0) {
        obj.handle = h;
        obj.has_handle = true;
      }
    } else if (key != nullptr && (std::strcmp(key, "Service") == 0 || std::strcmp(key, "Characteristic") == 0)) {
      const char *p = nullptr;
      sd_bus_message_read(m, "v", "o", &p);
      if (p != nullptr)
        obj.parent = p;
    } else if (key != nullptr && is_char && std::strcmp(key, "Flags") == 0) {
      sd_bus_message_enter_container(m, 'v', "as");
      sd_bus_message_enter_container(m, 'a', "s");
      const char *flag = nullptr;
      while (sd_bus_message_read(m, "s", &flag) > 0)
        if (flag != nullptr)
          obj.props |= flag_to_prop(flag);
      sd_bus_message_exit_container(m);
      sd_bus_message_exit_container(m);
    } else {
      sd_bus_message_skip(m, "v");
    }
    sd_bus_message_exit_container(m);  // dict entry
  }
  sd_bus_message_exit_container(m);  // a{sv}
}

}  // namespace

bool BLEGattHost::walk_gatt_tree_(std::vector<DiscoveredService> &out) {
  if (this->bus_ == nullptr)
    return false;
  sd_bus_error err = SD_BUS_ERROR_NULL;
  sd_bus_message *reply = nullptr;
  int r = sd_bus_call_method(this->bus_, "org.bluez", "/", "org.freedesktop.DBus.ObjectManager", "GetManagedObjects",
                             &err, &reply, "");
  if (r < 0) {
    ESP_LOGW(TAG, "GetManagedObjects failed: %s", err.message ? err.message : std::strerror(-r));
    sd_bus_error_free(&err);
    return false;
  }

  std::vector<GattObj> objs;
  // reply: a{oa{sa{sv}}}
  sd_bus_message_enter_container(reply, 'a', "{oa{sa{sv}}}");
  for (;;) {
    if (sd_bus_message_enter_container(reply, 'e', "oa{sa{sv}}") <= 0)
      break;
    const char *path = nullptr;
    sd_bus_message_read(reply, "o", &path);
    bool under_device =
        (path != nullptr && std::strncmp(path, this->device_path_.c_str(), this->device_path_.size()) == 0 &&
         path[this->device_path_.size()] == '/');
    GattObj obj;
    if (path != nullptr)
      obj.path = path;
    sd_bus_message_enter_container(reply, 'a', "{sa{sv}}");
    for (;;) {
      if (sd_bus_message_enter_container(reply, 'e', "sa{sv}") <= 0)
        break;
      const char *iface = nullptr;
      sd_bus_message_read(reply, "s", &iface);
      bool is_gatt = iface != nullptr && (std::strcmp(iface, "org.bluez.GattService1") == 0 ||
                                          std::strcmp(iface, "org.bluez.GattCharacteristic1") == 0 ||
                                          std::strcmp(iface, "org.bluez.GattDescriptor1") == 0);
      if (under_device && is_gatt) {
        parse_gatt_iface_props(reply, iface, obj);
      } else {
        sd_bus_message_skip(reply, "a{sv}");
      }
      sd_bus_message_exit_container(reply);  // interface entry
    }
    sd_bus_message_exit_container(reply);  // a{sa{sv}}
    if (under_device && obj.kind != GattObj::OTHER)
      objs.push_back(std::move(obj));
    sd_bus_message_exit_container(reply);  // object entry
  }
  sd_bus_message_exit_container(reply);  // top array
  sd_bus_message_unref(reply);
  sd_bus_error_free(&err);

  // Assemble the tree by parent object-path links. Services first.
  this->handle_map_.clear();
  for (const auto &o : objs) {
    if (o.kind != GattObj::SERVICE)
      continue;
    DiscoveredService svc;
    svc.uuid = o.uuid;
    svc.start_handle = o.handle;
    svc.end_handle = o.handle;
    // characteristics whose parent Service == this path
    for (const auto &c : objs) {
      if (c.kind != GattObj::CHAR || c.parent != o.path)
        continue;
      if (!c.has_handle) {
        ESP_LOGE(TAG, "characteristic %s has no Handle", c.path.c_str());
        return false;  // hard requirement
      }
      DiscoveredCharacteristic dc;
      dc.uuid = c.uuid;
      dc.handle = c.handle;
      dc.properties = c.props;
      this->handle_map_[c.handle] = ObjEntry{c.path, ObjEntry::CHAR, c.handle};
      for (const auto &d : objs) {
        if (d.kind != GattObj::DESC || d.parent != c.path)
          continue;
        if (!d.has_handle) {
          ESP_LOGE(TAG, "descriptor %s has no Handle", d.path.c_str());
          return false;
        }
        dc.descriptors.push_back(DiscoveredDescriptor{d.uuid, d.handle});
        this->handle_map_[d.handle] = ObjEntry{d.path, ObjEntry::DESC, c.handle};
      }
      svc.characteristics.push_back(std::move(dc));
    }
    out.push_back(std::move(svc));
  }
  ESP_LOGD(TAG, "discovered %zu services on %s", out.size(), this->device_path_.c_str());
  return true;
}

