rjt-rockx/esphome-host-linux/components/esp32_ble_client/ble_gatt_host.cpp
uint16_t BLEGattHost::acquire_mtu_() {
  // Read GattCharacteristic1.MTU off any characteristic (BlueZ >= 5.62).
  for (const auto &kv : this->handle_map_) {
    if (kv.second.kind != ObjEntry::CHAR)
      continue;
    sd_bus_error err = SD_BUS_ERROR_NULL;
    uint16_t mtu = 0;
    int r = sd_bus_get_property_trivial(this->bus_, "org.bluez", kv.second.path.c_str(),
                                        "org.bluez.GattCharacteristic1", "MTU", &err, 'q', &mtu);
    sd_bus_error_free(&err);
    if (r >= 0 && mtu >= 23)
      return mtu;
  }
  return 23;  // fallback (the AcquireWrite probe lands in a later refinement)
}

void BLEGattHost::do_read_rssi_() {
  HostGattEvent ev;
  ev.kind = HostGattEvent::Kind::RSSI;
  ev.rssi = 0;
  if (this->bus_ != nullptr) {
    sd_bus_error err = SD_BUS_ERROR_NULL;
    int16_t rssi = 0;
    int r = sd_bus_get_property_trivial(this->bus_, "org.bluez", this->device_path_.c_str(), "org.bluez.Device1",
                                        "RSSI", &err, 'n', &rssi);
    sd_bus_error_free(&err);
    if (r >= 0)
      ev.rssi = static_cast<int8_t>(rssi);
  }
  this->post_event_(std::move(ev));
}

void BLEGattHost::do_pair_() {
  if (this->bus_ == nullptr)
    return;
  // Ensure our non-default agent is registered before pairing.
  BLEGattHostThread::instance().ensure_agent(this->bus_);
  sd_bus_error err = SD_BUS_ERROR_NULL;
  int r = sd_bus_call_method(this->bus_, "org.bluez", this->device_path_.c_str(), "org.bluez.Device1", "Pair", &err,
                             nullptr, "");
  HostGattEvent ev;
  ev.kind = HostGattEvent::Kind::PAIRING_COMPLETE;
  if (r < 0) {
    const char *name = err.name ? err.name : "";
    bool already = std::strstr(name, "AlreadyExists") != nullptr;
    ev.pairing_success = already;
    if (!already)
      ESP_LOGW(TAG, "Pair(%s) failed: %s", this->device_path_.c_str(), err.message ? err.message : std::strerror(-r));
  } else {
    ev.pairing_success = true;
  }
  sd_bus_error_free(&err);
  this->post_event_(std::move(ev));
}

void BLEGattHost::do_passkey_reply_(uint32_t passkey) {
  if (this->pending_agent_reply_ == nullptr)
    return;
  sd_bus_message *reply = this->pending_agent_reply_;
  this->pending_agent_reply_ = nullptr;
  // RequestPasskey returns a uint32.
  sd_bus_message *resp = nullptr;
  sd_bus_message_new_method_return(reply, &resp);
  sd_bus_message_append(resp, "u", passkey);
  sd_bus_send(this->bus_, resp, nullptr);
  sd_bus_message_unref(resp);
  sd_bus_message_unref(reply);
}

void BLEGattHost::do_confirm_reply_(bool accept) {
  if (this->pending_agent_reply_ == nullptr)
    return;
  sd_bus_message *reply = this->pending_agent_reply_;
  this->pending_agent_reply_ = nullptr;
  if (accept) {
    // RequestConfirmation returns void on accept.
    sd_bus_message *resp = nullptr;
    sd_bus_message_new_method_return(reply, &resp);
    sd_bus_send(this->bus_, resp, nullptr);
    sd_bus_message_unref(resp);
  } else {
    sd_bus_reply_method_errorf(reply, "org.bluez.Error.Rejected", "rejected");
  }
  sd_bus_message_unref(reply);
}

void BLEGattHost::do_remove_bond_() {
  if (this->bus_ == nullptr)
    return;
  // RemoveDevice on the adapter drops the bond.
  std::string adapter_path = "/org/bluez/" + this->adapter_;
  sd_bus_error err = SD_BUS_ERROR_NULL;
  sd_bus_call_method(this->bus_, "org.bluez", adapter_path.c_str(), "org.bluez.Adapter1", "RemoveDevice", &err, nullptr,
                     "o", this->device_path_.c_str());
  sd_bus_error_free(&err);
}

void BLEGattHost::agent_request_passkey(sd_bus_message *reply) {
  this->pending_agent_reply_ = sd_bus_message_ref(reply);
  HostGattEvent ev;
  ev.kind = HostGattEvent::Kind::PASSKEY_REQUEST;
  this->post_event_(std::move(ev));
}
void BLEGattHost::agent_display_passkey(uint32_t passkey) {
  HostGattEvent ev;
  ev.kind = HostGattEvent::Kind::PASSKEY_NOTIFY;
  ev.passkey = passkey;
  this->post_event_(std::move(ev));
}
void BLEGattHost::agent_request_confirmation(sd_bus_message *reply, uint32_t passkey) {
  this->pending_agent_reply_ = sd_bus_message_ref(reply);
  HostGattEvent ev;
  ev.kind = HostGattEvent::Kind::NUMERIC_COMPARE;
  ev.passkey = passkey;
  this->post_event_(std::move(ev));
}

namespace {
// Append the standard options dict ({} — no offset) to a Read/WriteValue call.
void append_empty_options(sd_bus_message *m) {
  sd_bus_message_open_container(m, 'a', "{sv}");
  sd_bus_message_close_container(m);
}
// Copy a 'ay' byte array out of a reply/message into a fresh owned buffer.
std::unique_ptr<uint8_t[]> read_ay(sd_bus_message *m, uint16_t &len_out) {
  const void *data = nullptr;
  size_t len = 0;
  if (sd_bus_message_read_array(m, 'y', &data, &len) < 0) {
    len_out = 0;
    return nullptr;
  }
  len_out = static_cast<uint16_t>(len);
  if (len == 0)
    return nullptr;
  auto buf = std::make_unique<uint8_t[]>(len);
  std::memcpy(buf.get(), data, len);
  return buf;
}
}  // namespace

void BLEGattHost::do_read_(uint16_t handle, bool is_desc) {
  auto it = this->handle_map_.find(handle);
  if (it == this->handle_map_.end()) {
    HostGattEvent ev;
    ev.kind = is_desc ? HostGattEvent::Kind::DESC_READ : HostGattEvent::Kind::READ_COMPLETE;
    ev.handle = handle;
    ev.status = ESP_GATT_INVALID_HANDLE;
    this->post_event_(std::move(ev));
    return;
  }
  const char *iface = (it->second.kind == ObjEntry::DESC) ? "org.bluez.GattDescriptor1" : "org.bluez.GattCharacteristic1";
  sd_bus_message *call = nullptr;
  sd_bus_message_new_method_call(this->bus_, &call, "org.bluez", it->second.path.c_str(), iface, "ReadValue");
  append_empty_options(call);
  sd_bus_error err = SD_BUS_ERROR_NULL;
  sd_bus_message *reply = nullptr;
  int r = sd_bus_call(this->bus_, call, 0, &err, &reply);
  sd_bus_message_unref(call);

  HostGattEvent ev;
  ev.kind = is_desc ? HostGattEvent::Kind::DESC_READ : HostGattEvent::Kind::READ_COMPLETE;
  ev.handle = handle;
  if (r < 0) {
    ev.status = ESP_GATT_ERROR;
    ESP_LOGW(TAG, "ReadValue(0x%04X) failed: %s", handle, err.message ? err.message : std::strerror(-r));
  } else {
    ev.status = ESP_GATT_OK;
    ev.data = read_ay(reply, ev.len);
  }
  sd_bus_error_free(&err);
  if (reply != nullptr)
    sd_bus_message_unref(reply);
  this->post_event_(std::move(ev));
}

void BLEGattHost::do_write_(uint16_t handle, const std::vector<uint8_t> &data, bool response, bool is_desc) {
  // CCCD interception: a write of {0x01,0x00}/{0x02,0x00} to a 0x2902 descriptor
  // → StartNotify on the parent char; {0x00,0x00} → StopNotify. BlueZ owns CCCD.
  auto it = this->handle_map_.find(handle);
  HostGattEvent ev;
  ev.kind = is_desc ? HostGattEvent::Kind::DESC_WRITE : HostGattEvent::Kind::WRITE_COMPLETE;
  ev.handle = handle;
  if (it == this->handle_map_.end()) {
    ev.status = ESP_GATT_INVALID_HANDLE;
    this->post_event_(std::move(ev));
    return;
  }
  const char *iface = (it->second.kind == ObjEntry::DESC) ? "org.bluez.GattDescriptor1" : "org.bluez.GattCharacteristic1";
  sd_bus_message *call = nullptr;
  sd_bus_message_new_method_call(this->bus_, &call, "org.bluez", it->second.path.c_str(), iface, "WriteValue");
  sd_bus_message_append_array(call, 'y', data.data(), data.size());
  // options: {"type": "request"|"command"}
  sd_bus_message_open_container(call, 'a', "{sv}");
  sd_bus_message_open_container(call, 'e', "sv");
  sd_bus_message_append(call, "s", "type");
  sd_bus_message_append(call, "v", "s", response ? "request" : "command");
  sd_bus_message_close_container(call);
  sd_bus_message_close_container(call);
  sd_bus_error err = SD_BUS_ERROR_NULL;
  int r = sd_bus_call(this->bus_, call, 0, &err, nullptr);
  sd_bus_message_unref(call);
  // Always post WRITE_COMPLETE (both write types) so action chains never hang.
  ev.status = (r < 0) ? ESP_GATT_ERROR : ESP_GATT_OK;
  if (r < 0)
    ESP_LOGW(TAG, "WriteValue(0x%04X) failed: %s", handle, err.message ? err.message : std::strerror(-r));
  sd_bus_error_free(&err);
  this->post_event_(std::move(ev));
}

void BLEGattHost::do_set_notify_(uint16_t handle, bool enable) {
  auto it = this->handle_map_.find(handle);
  HostGattEvent ev;
  ev.kind = HostGattEvent::Kind::NOTIFY_REGISTERED;
  ev.handle = handle;
  if (it == this->handle_map_.end() || it->second.kind != ObjEntry::CHAR) {
    ev.status = ESP_GATT_INVALID_HANDLE;
    this->post_event_(std::move(ev));
    return;
  }
  const std::string &path = it->second.path;
  sd_bus_error err = SD_BUS_ERROR_NULL;
  int r = sd_bus_call_method(this->bus_, "org.bluez", path.c_str(), "org.bluez.GattCharacteristic1",
                             enable ? "StartNotify" : "StopNotify", &err, nullptr, "");
  if (r < 0) {
    ESP_LOGW(TAG, "%s(0x%04X) failed: %s", enable ? "StartNotify" : "StopNotify", handle,
             err.message ? err.message : std::strerror(-r));
    ev.status = ESP_GATT_ERROR;
  } else {
    ev.status = ESP_GATT_OK;
    if (enable) {
      this->subscribe_value_(path, handle);
    } else {
      auto sub = this->notify_subs_.find(path);
      if (sub != this->notify_subs_.end()) {
        if (sub->second.slot != nullptr)
          sd_bus_slot_unref(sub->second.slot);
        this->notify_subs_.erase(sub);
      }
    }
  }
  sd_bus_error_free(&err);
  this->post_event_(std::move(ev));
}

void BLEGattHost::subscribe_value_(const std::string &char_path, uint16_t handle) {
  if (this->notify_subs_.count(char_path))
    return;  // already subscribed
  NotifySub sub{handle, nullptr};
  std::string match = "type='signal',interface='org.freedesktop.DBus.Properties',member='PropertiesChanged',path='" +
                      char_path + "'";
  // userdata is `this`; the handler maps path→handle via notify_subs_.
  sd_bus_add_match(this->bus_, &sub.slot, match.c_str(), &BLEGattHost::on_value_changed_, this);
  this->notify_subs_[char_path] = sub;
}

int BLEGattHost::on_value_changed_(sd_bus_message *m, void *userdata, sd_bus_error * /*ret_error*/) {
  auto *self = static_cast<BLEGattHost *>(userdata);
  const char *path = sd_bus_message_get_path(m);
  if (path == nullptr)
    return 0;
  auto sub = self->notify_subs_.find(path);
  if (sub == self->notify_subs_.end())
    return 0;
  uint16_t handle = sub->second.handle;

