rjt-rockx/esphome-host-linux/components/esp32_ble_client/ble_gatt_host.cpp
  const char *iface = nullptr;
  if (sd_bus_message_read(m, "s", &iface) < 0)
    return 0;
  if (iface == nullptr || std::strcmp(iface, "org.bluez.GattCharacteristic1") != 0)
    return 0;
  if (sd_bus_message_enter_container(m, 'a', "{sv}") < 0)
    return 0;
  for (;;) {
    if (sd_bus_message_enter_container(m, 'e', "sv") <= 0)
      break;
    const char *key = nullptr;
    sd_bus_message_read(m, "s", &key);
    if (key != nullptr && std::strcmp(key, "Value") == 0) {
      sd_bus_message_enter_container(m, 'v', "ay");
      HostGattEvent ev;
      ev.kind = HostGattEvent::Kind::NOTIFY;
      ev.handle = handle;
      ev.data = read_ay(m, ev.len);
      sd_bus_message_exit_container(m);
      self->post_event_(std::move(ev));
    } else {
      sd_bus_message_skip(m, "v");
    }
    sd_bus_message_exit_container(m);
  }
  sd_bus_message_exit_container(m);
  return 0;
}

int BLEGattHost::on_properties_changed_(sd_bus_message *m, void *userdata, sd_bus_error * /*ret_error*/) {
  auto *self = static_cast<BLEGattHost *>(userdata);
  const char *iface = nullptr;
  if (sd_bus_message_read(m, "s", &iface) < 0)
    return 0;
  if (iface == nullptr || std::strcmp(iface, "org.bluez.Device1") != 0)
    return 0;

  // changed: a{sv}
  if (sd_bus_message_enter_container(m, 'a', "{sv}") < 0)
    return 0;
  for (;;) {
    int r = sd_bus_message_enter_container(m, 'e', "sv");
    if (r <= 0)
      break;
    const char *key = nullptr;
    sd_bus_message_read(m, "s", &key);
    if (key != nullptr && std::strcmp(key, "Connected") == 0) {
      int connected = 0;
      sd_bus_message_read(m, "v", "b", &connected);
      self->worker_on_connected_changed(connected != 0);
    } else if (key != nullptr && std::strcmp(key, "ServicesResolved") == 0) {
      int resolved = 0;
      sd_bus_message_read(m, "v", "b", &resolved);
      if (resolved)
        self->try_start_discovery_();
    } else {
      sd_bus_message_skip(m, "v");
    }
    sd_bus_message_exit_container(m);
  }
  sd_bus_message_exit_container(m);
  return 0;
}

void BLEGattHost::worker_on_connected_changed(bool connected) {
  HostGattEvent ev;
  if (connected) {
    ev.kind = HostGattEvent::Kind::CONNECTED;
    this->post_event_(std::move(ev));
    // ServicesResolved may already be true (the signal won't re-fire); poll it.
    if (this->bus_ != nullptr) {
      sd_bus_error err = SD_BUS_ERROR_NULL;
      int resolved = 0;
      int r = sd_bus_get_property_trivial(this->bus_, "org.bluez", this->device_path_.c_str(), "org.bluez.Device1",
                                          "ServicesResolved", &err, 'b', &resolved);
      sd_bus_error_free(&err);
      if (r >= 0 && resolved)
        this->try_start_discovery_();
    }
  } else {
    this->discovered_ = false;
    this->handle_map_.clear();
    ev.kind = HostGattEvent::Kind::DISCONNECTED;
    this->post_event_(std::move(ev));
  }
}

// Walk the GATT tree once, build the discovery snapshot + handle maps, acquire
// MTU, and post SERVICES_DISCOVERED. Idempotent per connection.
void BLEGattHost::try_start_discovery_() {
  if (this->discovered_)
    return;
  std::vector<DiscoveredService> tree;
  if (!this->walk_gatt_tree_(tree)) {
    // A GATT object lacked a real Handle (BlueZ < 5.62) — protocol-breaking for
    // the proxy contract. Hard-fail the connection.
    ESP_LOGE(TAG, "GATT object missing Handle (need BlueZ >= 5.62); disconnecting %s",
             this->device_path_.c_str());
    this->do_disconnect_();
    return;
  }
  this->discovered_ = true;
  HostGattEvent ev;
  ev.kind = HostGattEvent::Kind::SERVICES_DISCOVERED;
  ev.mtu = this->acquire_mtu_();
  ev.services = std::move(tree);
  this->post_event_(std::move(ev));
}

}  // namespace esp32_ble_client
}  // namespace esphome

#endif  // USE_HOST
